In [11]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn import linear_model
import warnings
warnings.filterwarnings("ignore")

In [12]:
df = pd.read_csv('HomePrices.csv')
df

   area  bedrooms  age    price
0  2600       3.0    20  550000
1  3000       4.0    15  565000
2  3200       NaN    18  610000
3  3600       3.0    30  595000
4  4000       5.0     8  760000
5  4100       6.0     8  810000

In [13]:
df.bedrooms.median()

4.0

In [14]:
df.bedrooms = df.bedrooms.fillna(df.bedrooms.median())
df

   area  bedrooms  age    price
0  2600       3.0    20  550000
1  3000       4.0    15  565000
2  3200       4.0    18  610000
3  3600       3.0    30  595000
4  4000       5.0     8  760000
5  4100       6.0     8  810000

In [15]:
df['bedrooms'] = df['bedrooms'].astype(int) 
df

   area  bedrooms  age    price
0  2600         3    20  550000
1  3000         4    15  565000
2  3200         4    18  610000
3  3600         3    30  595000
4  4000         5     8  760000
5  4100         6     8  810000

In [ ]:
reg = linear_model.LinearRegression()
reg.fit(df.drop('price',axis='columns'),df.price)

In [ ]:
reg.coef_

In [ ]:
reg.intercept_

In [ ]:
reg.predict([[3200,3,15]])

In [ ]:
reg.predict([[2600,4,20]])